function normalizeInput(str?: string): string {
    return (str || '').trim().toLowerCase();
}

const maleGender = [
    'машки',
    'деца-момчиња',
    'мажи',
    'момчиња возраст 0-4 години',
    'момчиња возраст 4-14 години',
    'за мажи',
    'за момчиња',
    'момчиња',
    'Male',
];

const femaleGender = [
    'женски',
    'деца-девојчиња',
    'за жени',
    'за девојчиња',
    'жени',
    'девојчиња',
    'девојчиња возраст 0-4 години',
    'девојчиња возраст 4-14 години',
    'Female',
];

const unisexGender = ['унисекс', 'unisex детски', 'деца', 'Unisex', 'Kids'];

const adultAge = ['за возрасни', 'Adult'];
const kidsAge = [
    'за деца',
    'за тинејџери (8-14 год.)',
    'за мали деца (4-10 год.)',
    'за бебиња (0-4 год.)',
    'за мали деца (од 4-7 год.)',
    'за тинејџери (од 8-16 год.)',
    'мали деца',
    'за тинејџери',
    'Kids',
    'Unisex',
];

const subcategories: Record<string, string[]> = {
    Патики: [
        'патики',
        'спринтерици',
        'патики-ниски',
        'патики-високи',
        'фудбал-сала',
        'патики за вештачка трева',
        'машки патики',
        'патики за трчање',
        'патики за шетање',
        'патики за кошарка',
        'патики за фудбал',
        'патики за ракомет',
        'женски патики',
        'детски патики',
        'обувки за фудбал',
    ],
    Копачки: ['копачки', 'фудбал-копачки'],
    'Кондури и чизми': ['кондури', 'чизми', 'кондури и чизми', 'чевли'],
    'Папучи и сандали': ['папучи', 'сандали', 'апостолки', 'папучи и сандали', 'обувки за вода'],
    Дуксери: ['дуксери', 'дуксер', 'блузон', 'блузони', 'софтшел', 'полари'],
    Маици: ['маица', 'маици', 'поло маици'],
    'Долен дел тренерки': ['долен дел тренерки', 'долни делови тренерки'],
    Тренерка: ['тренерка'],
    'Јакни и елеци': [
        'јакни и елеци',
        'јакна',
        'јакни',
        'елек',
        'елеци',
        'шушкавец',
        'шушкавци',
        'заштитен сет за дожд',
        'ветровка',
        'ветровки',
        'ветровки и јакни',
    ],
    Панталони: ['панталони'],
    Шорцеви: ['шорцеви', 'шорц', 'шорцеви за пливање'],
    Хеланки: ['хеланки', 'хеланки и бициклистички', 'бицисклистички'],
    Градник: ['градник', 'топ', 'градник и топ', 'спортски градници'],
    'Фустани и сукњи': [
        'фустан',
        'фустани',
        'сукња',
        'сукњи',
        'фустани и сукњи',
        'долг фустан',
        'зидолништа',
        'здолниште',
    ],
    'Костими за капење': ['костими за капење', 'костим за капење'],
    Комбинезон: ['комбинезон', 'комбинезони'],
    'Долна облека': ['долна облека', 'боди'],
    Комплети: ['шорц и маица', 'летни комплети'],
    'Активна облека': ['активна облека', 'облека за вежбање'],
    Чорапи: ['чорапи'],
    'Качкети и капи': [
        'качкет',
        'качкети',
        'капа',
        'капи',
        'качкети и капи',
        'зимска капа',
        'зимски капи',
    ],
    Ранец: ['ранец', 'ранци'],
    'Опрема за тренинг': [
        'вреќа за тренинг',
        'голмански ракавици',
        'фитнес топка',
        'подлога',
        'костобрани',
        'голманска ракавица',
        'држачи за склекови',
        'фитнес реквизит',
        'шипка за вежбање',
        'бандажер',
        'наочари за скијање',
        'crep protect',
        'тегови',
    ],
    'Опрема за пливање': [
        'наочари за пливање',
        'капа за пливање',
        'чепови за уши',
        'штипка за нос',
        'маска',
        'маска и пераи',
        'пешкир',
    ],
    Шишиња: ['шише', 'шишиња', 'шише за вода', 'термос'],
    Ролери: ['ролери'],
    Тренерки: ['тренерки', 'комплет тренерки'],
    Топки: ['топка', 'топки'],
    'Маици со долги ракави': [
        'маица со долги ракави',
        'маици со долги ракави',
        'маица долги ракави',
        'маици долги ракави',
    ],
    'Торби и торбици': [
        'торба',
        'торби',
        'торбица',
        'торбици',
        'торби и торбици',
        'торбичка',
        'торбички',
    ],
    Тротинет: ['тротинет', 'тротинети'],
    Дресови: ['дрес', 'дресови', 'дресови-фудбал'],
    Бандани: ['бандани', 'маски', 'заштитна маска за лице'],
    Скироли: ['скироли'],
    Шалови: ['шал', 'шалови'],
    Ракавици: ['ракавици', 'нараквици'],
    Врвки: ['врвки', 'врвци'],
};

const colors: Record<string, string[]> = {
    Беж: ['Беж', 'крем'],
    Бела: ['Бела', 'бело'],
    Бордо: ['Бордо'],
    Жолта: ['Жолта', 'жолто'],
    Зелена: ['Зелена', 'зелено'],
    Златна: ['Златна', 'златно'],
    Кафеава: ['Кафеава', 'кафена'],
    Виолетова: ['Виолетова', 'лилакова'],
    Мултиколор: ['Мултиколор', 'маскирна', 'повеќебоја'],
    Сина: ['Сина', 'плава', 'svetlo plava'],
    Портокалова: ['Портокалова', 'портокалови'],
    Розева: ['Розева', 'розе', 'роза'],
    Сива: ['Сива', 'сиво'],
    Сребрена: ['Сребрена', 'сребрено'],
    Тегет: ['Тегет'],
    Црвена: ['Црвена', 'црвено'],
    Црна: ['Црна', 'црно'],
};

export function normalizeGender(gender: string): string {
    const g = normalizeInput(gender);
    if (maleGender.includes(g)) return 'Машки';
    if (femaleGender.includes(g)) return 'Женски';
    if (unisexGender.includes(g)) return 'Унисекс';
    return 'Унисекс';
}

export function normalizeAge(age: string): string {
    const a = normalizeInput(age);
    if (adultAge.includes(a)) return 'За возрасни';
    if (kidsAge.includes(a)) return 'За деца';
    return 'За деца';
}

export function normalizeColor(color: string): string {
    const c = normalizeInput(color);

    const capitalize = (s: string) =>
        s.charAt(0).toUpperCase() + s.slice(1).toLowerCase();

    for (const [standard, variants] of Object.entries(colors)) {
        if (variants.includes(c)) {
            return capitalize(standard);
        }
    }

    return capitalize('Мултиколор');
}


export function normalizeSubcategory(subcategory: string): string {
    const c = normalizeInput(subcategory);
    for (const [standard, variants] of Object.entries(subcategories)) {
        if (variants.map((v) => v.toLowerCase()).includes(c)) {
            return standard;
        }
    }
    return 'Останато';
}

export function capitalizeFirstLetter(brand: string): string {
    if (!brand) return brand;
    return brand.charAt(0).toUpperCase() + brand.slice(1).toLowerCase();
}
